lane_b_engineering/skills/02-seeded-defect-red-green/assets/track-b-defect.patch
--- a/nemweb_foundation/agentic_energy/nemweb/pipeline/io.py
+++ b/nemweb_foundation/agentic_energy/nemweb/pipeline/io.py
@@ -205,7 +205,16 @@
             "interval_end"
         ),
         "landed_at",
-        F.current_timestamp().alias("ingested_at"),
+        # WORKSHOP DEFECT: this converts the UTC instant to an AEST wall-clock
+        # string and parses it back without an offset. Freshness comparisons
+        # across systems can therefore be ten hours wrong. Track B must remove
+        # this conversion while keeping market interval_end in fixed AEST.
+        F.to_timestamp(
+            F.date_format(
+                F.from_utc_timestamp(F.current_timestamp(), "Australia/Brisbane"),
+                "yyyy-MM-dd HH:mm:ss",
+            )
+        ).alias("ingested_at"),
         "ingestion_run_id",
         # landed_at is globally ordered across runs; row number is the stable
         # final tie-break within an archive. Silver also orders by landed_at.
